RIET/src/AccumulationRegisters/ItemsWithoutCVCDecision/ItemsWithoutCVCDecision.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ItemsWithoutCVCDecision</name>
  <resources>
    <name>Ресурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Item</name>
    <type>
      <types>CatalogRef.СтрокиИнвойса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CustomsBond</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/ItemsWithoutCVCDecision/ManagerModule.bsl
Функция ПолучитьОстаткиПоItems(МоментВремени, Items) Экспорт
	
	// Возвращает таблицу остатков, отобранных по Items
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
	Запрос.УстановитьПараметр("Items", Items);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ItemsWithoutCVCDecisionОстатки.Item,
		|	ItemsWithoutCVCDecisionОстатки.CustomsBond,
		|	ItemsWithoutCVCDecisionОстатки.РесурсОстаток
		|ИЗ
		|	РегистрНакопления.ItemsWithoutCVCDecision.Остатки(&МоментВремени, Item В (&Items)) КАК ItemsWithoutCVCDecisionОстатки";
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьОстаткиПоCustomsBond(ГраницаДляОстатков, CustomsBond) Экспорт
	
	Если НЕ ЗначениеЗаполнено(CustomsBond) Тогда
		ВызватьИсключение "Customs bond is empty!";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ГраницаДляОстатков", ГраницаДляОстатков);
	Запрос.УстановитьПараметр("CustomsBond", CustomsBond);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ItemsWithoutCVCDecisionОстатки.Item,
		|	ItemsWithoutCVCDecisionОстатки.РесурсОстаток
		|ИЗ
		|	РегистрНакопления.ItemsWithoutCVCDecision.Остатки(&ГраницаДляОстатков, CustomsBond = &CustomsBond) КАК ItemsWithoutCVCDecisionОстатки";
		
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции
